Repository: fparrav/LiveWalls
Catalog: LiveWalls/Resources/Localizations/*.lproj/Localizable.strings
Languages: de, es, fr, it, ja, pt_br, zh_cn, zh_tw

# settings_title
source: Live Walls Settings
de: Live Walls Einstellungen
es: Configuración de Live Walls
fr: Paramètres de Live Walls
it: Impostazioni Live Walls
ja: Live Walls 設定
pt_br: Configurações do Live Walls
zh_cn: Live Walls 设置
zh_tw: Live Walls 設定

# import_button
source: Import
de: Importieren
es: Importar
fr: Importer
it: Importa
ja: インポート
pt_br: Importar
zh_cn: 导入
zh_tw: 匯入

# settings_button
source: Settings
de: Einstellungen
es: Configuración
fr: Paramètres
it: Impostazioni
ja: 設定
pt_br: Configurações
zh_cn: 设置
zh_tw: 設定

# accept_button
source: Accept
de: Akzeptieren
es: Aceptar
fr: Accepter
it: Accetta
ja: OK
pt_br: Aceitar
zh_cn: 确定
zh_tw: 確定

# cancel_button
source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
pt_br: Cancelar
zh_cn: 取消
zh_tw: 取消

# delete_button
source: Delete
de: Löschen
es: Eliminar
fr: Supprimer
it: Elimina
ja: 削除
pt_br: Excluir
zh_cn: 删除
zh_tw: 刪除

# play_button
source: Play
de: Wiedergeben
es: Reproducir
fr: Lire
it: Riproduci
ja: 再生
pt_br: Reproduzir
zh_cn: 播放
zh_tw: 播放

# stop_button
source: Stop
de: Stoppen
es: Detener
fr: Arrêter
it: Ferma
ja: 停止
pt_br: Parar
zh_cn: 停止
zh_tw: 停止

# import_videos_button
source: Import Videos
de: Videos importieren
es: Importar Videos
fr: Importer des vidéos
it: Importa Video
ja: ビデオをインポート
pt_br: Importar Vídeos
zh_cn: 导入视频
zh_tw: 匯入影片

# import_help
source: Add videos
de: Videos hinzufügen
es: Agregar videos
fr: Ajouter des vidéos
it: Aggiungi video
ja: ビデオを追加
pt_br: Adicionar vídeos
zh_cn: 添加视频
zh_tw: 新增影片

# settings_help
source: Application settings
de: Anwendungseinstellungen
es: Configuración de la aplicación
fr: Paramètres de l'application
it: Impostazioni applicazione
ja: アプリケーション設定
pt_br: Configurações do aplicativo
zh_cn: 应用程序设置
zh_tw: 應用程式設定

# no_videos_title
source: No videos added
de: Keine Videos hinzugefügt
es: No hay videos agregados
fr: Aucune vidéo ajoutée
it: Nessun video aggiunto
ja: ビデオが追加されていません
pt_br: Nenhum vídeo adicionado
zh_cn: 未添加视频
zh_tw: 未新增影片

# no_videos_description
source: Click 'Import' to add videos and set them as wallpaper
de: Klicken Sie auf 'Importieren', um Videos hinzuzufügen und als Hintergrundbild festzulegen
es: Haz clic en 'Importar' para agregar videos y establecerlos como fondo de pantalla
fr: Cliquez sur 'Importer' pour ajouter des vidéos et les définir comme fond d'écran
it: Clicca 'Importa' per aggiungere video e impostarli come sfondo
ja: 「インポート」をクリックしてビデオを追加し、壁紙として設定してください
pt_br: Clique em 'Importar' para adicionar vídeos e defini-los como papel de parede
zh_cn: 点击「导入」添加视频并设置为壁纸
zh_tw: 點按「匯入」新增影片並設定為桌布

source: Active wallpaper: %@
de: Aktives Hintergrundbild: %@
es: Wallpaper activo: %@
fr: Fond d'écran actif : %@
it: Sfondo attivo: %@
ja: アクティブな壁紙: %@
pt_br: Papel de parede ativo: %@
zh_cn: 活动壁纸：%@
zh_tw: 使用中桌布：%@

source: No active wallpaper
de: Kein aktives Hintergrundbild
es: Sin wallpaper activo
fr: Aucun fond d'écran actif
it: Nessuno sfondo attivo
ja: アクティブな壁紙なし
pt_br: Nenhum papel de parede ativo
zh_cn: 无活动壁纸
zh_tw: 無使用中桌布

# videos_total
source: %d videos total
de: %d Videos insgesamt
fr: %d vidéos au total
it: %d video in totale
ja: 合計 %d 個のビデオ
pt_br: %d vídeos no total
zh_cn: 共 %d 个视频
zh_tw: 共 %d 部影片

source: 🎬 Current Wallpaper
de: 🎬 Aktuelles Hintergrundbild
es: 🎬 Wallpaper Actual
fr: 🎬 Fond d'écran actuel
it: 🎬 Sfondo Corrente
ja: 🎬 現在の壁紙
pt_br: 🎬 Papel de Parede Atual
zh_cn: 🎬 当前壁纸
zh_tw: 🎬 目前桌布

# open_app
source: Open application
de: Anwendung öffnen
es: Abrir aplicación
fr: Ouvrir l'application
it: Apri applicazione
ja: アプリケーションを開く
pt_br: Abrir aplicativo
zh_cn: 打开应用程序
zh_tw: 開啟應用程式

source: Stop wallpaper
de: Hintergrundbild stoppen
es: Detener wallpaper
fr: Arrêter le fond d'écran
it: Ferma sfondo
ja: 壁紙を停止
pt_br: Parar papel de parede
zh_cn: 停止壁纸
zh_tw: 停止桌布

source: Play wallpaper
de: Hintergrundbild wiedergeben
es: Reproducir wallpaper
fr: Lire le fond d'écran
it: Riproduci sfondo
ja: 壁紙を再生
pt_br: Reproduzir papel de parede
zh_cn: 播放壁纸
zh_tw: 播放桌布

source: Auto launch
de: Automatischer Start
es: Inicio automático
fr: Lancement automatique
it: Avvio automatico
ja: 自動起動
pt_br: Início automático
zh_cn: 自动启动
zh_tw: 自動啟動

# quit_app
source: Quit Live Walls
de: Live Walls beenden
es: Salir de Live Walls
fr: Quitter Live Walls
it: Esci da Live Walls
ja: Live Walls を終了
pt_br: Sair do Live Walls
zh_cn: 退出 Live Walls
zh_tw: 結束 Live Walls

# general_playback_section
source: General Playback
de: Allgemeine Wiedergabe
es: Reproducción General
fr: Lecture générale
it: Riproduzione Generale
ja: 一般再生
pt_br: Reprodução Geral
zh_cn: 常规播放
zh_tw: 一般播放

# system_section
source: System
es: Sistema
fr: Système
it: Sistema
ja: システム
pt_br: Sistema
zh_cn: 系统
zh_tw: 系統

# auto_change_section
source: Auto Change Wallpaper
de: Automatischer Hintergrundbildwechsel
es: Cambio Automático de Wallpaper
fr: Changement automatique du fond d'écran
it: Cambio Automatico Sfondo
ja: 壁紙の自動変更
pt_br: Mudança Automática de Papel de Parede
zh_cn: 自动更换壁纸
zh_tw: 自動更換桌布

# video_management_section
source: Video Management
de: Video-Verwaltung
es: Gestión de Videos
fr: Gestion des vidéos
it: Gestione Video
ja: ビデオ管理
pt_br: Gerenciamento de Vídeos
zh_cn: 视频管理
zh_tw: 影片管理

# auto_start_wallpaper
source: Start wallpaper automatically when opening the app
de: Hintergrundbild automatisch beim Öffnen der App starten
es: Iniciar wallpaper automáticamente al abrir la app
fr: Démarrer automatiquement le fond d'écran à l'ouverture de l'app
it: Avvia sfondo automaticamente all'apertura dell'app
ja: アプリ起動時に壁紙を自動開始
pt_br: Iniciar papel de parede automaticamente ao abrir o app
zh_cn: 打开应用时自动启动壁纸
zh_tw: 開啟應用程式時自動啟動桌布

source: Mute videos
de: Videos stumm schalten
es: Silenciar videos
fr: Couper le son des vidéos
it: Silenzia video
ja: ビデオをミュート
pt_br: Silenciar vídeos
zh_cn: 静音视频
zh_tw: 將影片靜音

# launch_at_login
source: Launch Live Walls at login
de: Live Walls beim Anmelden starten
es: Iniciar Live Walls con el sistema
fr: Lancer Live Walls à la connexion
it: Avvia Live Walls al login
ja: ログイン時に Live Walls を起動
pt_br: Iniciar Live Walls no login
zh_cn: 登录时启动 Live Walls
zh_tw: 登入時啟動 Live Walls

# launch_at_login_help
source: Automatically start Live Walls when you log into macOS
de: Live Walls automatisch beim Anmelden bei macOS starten
es: Inicia automáticamente Live Walls cuando inicies sesión en macOS
fr: Démarrer automatiquement Live Walls lors de la connexion à macOS
it: Avvia automaticamente Live Walls quando accedi a macOS
ja: macOS ログイン時に Live Walls を自動的に開始
pt_br: Iniciar automaticamente o Live Walls quando você fizer login no macOS
zh_cn: 登录 macOS 时自动启动 Live Walls
zh_tw: 登入 macOS 時自動啟動 Live Walls

# enable_auto_change
source: Enable automatic wallpaper change
de: Automatischen Hintergrundbildwechsel aktivieren
es: Activar cambio automático de wallpaper
fr: Activer le changement automatique du fond d'écran
it: Abilita cambio automatico sfondo
ja: 壁紙の自動変更を有効化
pt_br: Ativar mudança automática de papel de parede
zh_cn: 启用自动更换壁纸
zh_tw: 啟用自動更換桌布

# interval_label
source: Interval:
de: Intervall:
es: Intervalo:
fr: Intervalle :
it: Intervallo:
ja: 間隔:
pt_br: Intervalo:
zh_cn: 间隔：
zh_tw: 間隔：

# videos_saved
source: Videos saved: %d
de: Gespeicherte Videos: %d
es: Videos guardados: %d
fr: Vidéos sauvegardées : %d
it: Video salvati: %d
ja: 保存されたビデオ: %d
pt_br: Vídeos salvos: %d
zh_cn: 已保存视频：%d
zh_tw: 已儲存影片：%d

source: Clear all videos
de: Alle Videos löschen
es: Limpiar todos los videos
fr: Effacer toutes les vidéos
it: Cancella tutti i video
ja: すべてのビデオをクリア
pt_br: Limpar todos os vídeos
zh_cn: 清除所有视频
zh_tw: 清除所有影片

# delete_all_videos_title
source: Delete all videos?
de: Alle Videos löschen?
es: ¿Eliminar todos los videos?
fr: Supprimer toutes les vidéos ?
it: Eliminare tutti i video?
ja: すべてのビデオを削除しますか？
pt_br: Excluir todos os vídeos?
zh_cn: 删除所有视频？
zh_tw: 刪除所有影片？

# delete_all_videos_message
source: This action will delete all saved videos. Do you want to continue?
de: Diese Aktion löscht alle gespeicherten Videos. Möchten Sie fortfahren?
es: Esta acción eliminará todos los videos guardados. ¿Deseas continuar?
fr: Cette action supprimera toutes les vidéos sauvegardées. Voulez-vous continuer ?
it: Questa azione eliminerà tutti i video salvati. Vuoi continuare?
ja: この操作により、保存されたすべてのビデオが削除されます。続行しますか？
pt_br: Esta ação excluirá todos os vídeos salvos. Deseja continuar?
zh_cn: 此操作将删除所有已保存的视频。是否继续？
zh_tw: 此操作將刪除所有已儲存的影片。是否繼續？

# wallpaper_set
source: Video set as wallpaper
de: Video als Hintergrundbild festgelegt
es: Video establecido como wallpaper
fr: Vidéo définie comme fond d'écran
it: Video impostato come sfondo
ja: ビデオが壁紙として設定されました
pt_br: Vídeo definido como papel de parede
zh_cn: 视频已设置为壁纸
zh_tw: 影片已設定為桌布

# wallpaper_error
source: Error setting wallpaper
de: Fehler beim Festlegen des Hintergrundbilds
es: Error al establecer wallpaper
fr: Erreur lors de la définition du fond d'écran
it: Errore nell'impostazione dello sfondo
ja: 壁紙設定エラー
pt_br: Erro ao definir papel de parede
zh_cn: 设置壁纸错误
zh_tw: 設定桌布錯誤

# import_error
source: Error importing videos
de: Fehler beim Importieren von Videos
es: Error al importar videos
fr: Erreur lors de l'importation des vidéos
it: Errore nell'importazione video
ja: ビデオインポートエラー
pt_br: Erro ao importar vídeos
zh_cn: 导入视频错误
zh_tw: 匯入影片錯誤

# wallpaper_started_notification
source: Wallpaper started: %@
de: Hintergrundbild gestartet: %@
es: Fondo de pantalla iniciado: %@
fr: Fond d'écran démarré : %@
it: Sfondo avviato: %@
ja: 壁紙が開始されました: %@
pt_br: Papel de parede iniciado: %@
zh_cn: 壁纸已启动：%@
zh_tw: 桌布已啟動：%@

# wallpaper_stopped_notification
source: Wallpaper stopped
de: Hintergrundbild gestoppt
es: Fondo de pantalla detenido
fr: Fond d'écran arrêté
it: Sfondo fermato
ja: 壁紙が停止されました
pt_br: Papel de parede parado
zh_cn: 壁纸已停止
zh_tw: 桌布已停止

# error_title
source: Error
de: Fehler
fr: Erreur
it: Errore
ja: エラー
pt_br: Erro
zh_cn: 错误
zh_tw: 錯誤

# minutes_format
source: %d min
ja: %d 分
zh_cn: %d 分钟
zh_tw: %d 分鐘

# macos_compatibility_warning
source: ⚠️ For macOS < 13.0, configure manually in System Preferences
de: ⚠️ Für macOS < 13.0 manuell in den Systemeinstellungen konfigurieren
es: ⚠️ Para macOS < 13.0, configure manualmente en Preferencias del Sistema
fr: ⚠️ Pour macOS < 13.0, configurez manuellement dans les Préférences Système
it: ⚠️ Per macOS < 13.0, configura manualmente nelle Preferenze di Sistema
ja: ⚠️ macOS < 13.0 の場合、システム環境設定で手動設定してください
pt_br: ⚠️ Para macOS < 13.0, configure manualmente nas Preferências do Sistema
zh_cn: ⚠️ 对于 macOS < 13.0，请在系统偏好设置中手动配置
zh_tw: ⚠️ 對於 macOS < 13.0，請在「系統偏好設定」中手動設定

source: 🏗️ Initializing WallpaperManager
de: 🏗️ WallpaperManager wird initialisiert
es: 🏗️ Inicializando WallpaperManager
fr: 🏗️ Initialisation du WallpaperManager
it: 🏗️ Inizializzazione WallpaperManager
ja: 🏗️ WallpaperManager を初期化中
pt_br: 🏗️ Inicializando WallpaperManager
zh_cn: 🏗️ 正在初始化 WallpaperManager
zh_tw: 🏗️ 正在初始化 WallpaperManager

# wallpaper_manager_initialized
source: ✅ WallpaperManager initialized correctly
de: ✅ WallpaperManager erfolgreich initialisiert
es: ✅ WallpaperManager inicializado correctamente
fr: ✅ WallpaperManager initialisé correctement
it: ✅ WallpaperManager inizializzato correttamente
ja: ✅ WallpaperManager が正常に初期化されました
pt_br: ✅ WallpaperManager inicializado corretamente
zh_cn: ✅ WallpaperManager 初始化正确
zh_tw: ✅ WallpaperManager 初始化正確

source: 🔄 Deinitializing WallpaperManager
de: 🔄 WallpaperManager wird deinitialisiert
es: 🔄 Deinicializando WallpaperManager
fr: 🔄 Désinitialisation du WallpaperManager
it: 🔄 Deinizializzazione WallpaperManager
ja: 🔄 WallpaperManager を非初期化中
pt_br: 🔄 Desinicializando WallpaperManager
zh_cn: 🔄 正在反初始化 WallpaperManager
zh_tw: 🔄 正在反初始化 WallpaperManager

# adding_video_files
source: 📁 Adding %d video files
de: 📁 %d Video-Dateien werden hinzugefügt
es: 📁 Agregando %d archivos de video
fr: 📁 Ajout de %d fichiers vidéo
it: 📁 Aggiunta di %d file video
ja: 📁 %d 個のビデオファイルを追加中
pt_br: 📁 Adicionando %d arquivos de vídeo
zh_cn: 📁 正在添加 %d 个视频文件
zh_tw: 📁 正在新增 %d 個影片檔案

# could_not_start_security_scoped_access
source: ⚠️ Could not start security-scoped access for: %@
de: ⚠️ Security-Scoped-Zugriff für %@ konnte nicht gestartet werden
es: ⚠️ No se pudo iniciar acceso security-scoped para: %@
fr: ⚠️ Impossible de démarrer l'accès security-scoped pour : %@
it: ⚠️ Impossibile avviare accesso con ambito di sicurezza per: %@
ja: ⚠️ %@ のセキュリティスコープアクセスを開始できませんでした
pt_br: ⚠️ Não foi possível iniciar acesso com escopo de segurança para: %@
zh_cn: ⚠️ 无法启动安全作用域访问：%@
zh_tw: ⚠️ 無法啟動安全範圍存取：%@

source: ❌ File not accessible: %@
de: ❌ Datei nicht zugänglich: %@
es: ❌ Archivo no accesible: %@
fr: ❌ Fichier non accessible : %@
it: ❌ File non accessibile: %@
ja: ❌ ファイルにアクセスできません: %@
pt_br: ❌ Arquivo não acessível: %@
zh_cn: ❌ 文件不可访问：%@
zh_tw: ❌ 檔案無法存取：%@

source: ✅ Video added: %@
de: ✅ Video hinzugefügt: %@
es: ✅ Video agregado: %@
fr: ✅ Vidéo ajoutée : %@
it: ✅ Video aggiunto: %@
ja: ✅ ビデオが追加されました: %@
pt_br: ✅ Vídeo adicionado: %@
zh_cn: ✅ 视频已添加：%@
zh_tw: ✅ 影片已新增：%@

# videos_count_updated
source: 📊 Videos in list: %d → %d
de: 📊 Videos in der Liste: %d → %d
es: 📊 Videos en lista: %d → %d
fr: 📊 Vidéos dans la liste : %d → %d
it: 📊 Video nella lista: %d → %d
ja: 📊 リスト内のビデオ: %d → %d
pt_br: 📊 Vídeos na lista: %d → %d
zh_cn: 📊 列表中的视频：%d → %d
zh_tw: 📊 清單中的影片：%d → %d

# error_processing_file
source: ❌ Error processing %@: %@
de: ❌ Fehler beim Verarbeiten von %@: %@
es: ❌ Error procesando %@: %@
fr: ❌ Erreur lors du traitement de %@ : %@
it: ❌ Errore durante l'elaborazione %@: %@
ja: ❌ %@ の処理エラー: %@
pt_br: ❌ Erro ao processar %@: %@
zh_cn: ❌ 处理 %@ 时出错：%@
zh_tw: ❌ 處理 %@ 時發生錯誤：%@

# could_not_generate_thumbnail
source: ⚠️ Could not generate thumbnail for: %@
de: ⚠️ Miniaturansicht für %@ konnte nicht generiert werden
es: ⚠️ No se pudo generar miniatura para: %@
fr: ⚠️ Impossible de générer la miniature pour : %@
it: ⚠️ Impossibile generare miniatura per: %@
ja: ⚠️ %@ のサムネイルを生成できませんでした
pt_br: ⚠️ Não foi possível gerar miniatura para: %@
zh_cn: ⚠️ 无法为以下项生成缩略图：%@
zh_tw: ⚠️ 無法為以下項目產生縮圖：%@

# videofiles_updated_debug
source: 🔄 VideoFiles updated: %d videos
de: 🔄 VideoFiles aktualisiert: %d Videos
es: 🔄 VideoFiles actualizado: %d videos
fr: 🔄 VideoFiles mis à jour : %d vidéos
it: 🔄 VideoFiles aggiornato: %d video
ja: 🔄 VideoFiles が更新されました: %d 個のビデオ
pt_br: 🔄 VideoFiles atualizado: %d vídeos
zh_cn: 🔄 VideoFiles 已更新：%d 个视频
zh_tw: 🔄 VideoFiles 已更新：%d 部影片

# names_debug
source: 📝 Names: %@
de: 📝 Namen: %@
es: 📝 Nombres: %@
fr: 📝 Noms : %@
it: 📝 Nomi: %@
ja: 📝 名前: %@
pt_br: 📝 Nomes: %@
zh_cn: 📝 名称：%@
zh_tw: 📝 名稱：%@

# notification_usage_description
source: LiveWalls needs notification permissions to inform you about wallpaper changes and important errors.
de: LiveWalls는 배경화면 변경 및 중요한 오류에 대해 알려주기 위해 알림 권한이 필요합니다.
es: LiveWalls necesita permisos de notificación para informarte sobre cambios en el fondo de pantalla y errores importantes.
fr: LiveWalls a besoin d'autorisations de notification pour vous informer des changements de fond d'écran et des erreurs importantes.
it: LiveWalls는 배경화면 변경 및 중요한 오류에 대해 알려주기 위해 알림 권한이 필요합니다.
ja: LiveWalls는 배경화면 변경 및 중요한 오류에 대해 알려주기 위해 알림 권한이 필요합니다.
pt_br: LiveWalls는 배경화면 변경 및 중요한 오류에 대해 알려주기 위해 알림 권한이 필요합니다.
zh_cn: LiveWalls는 배경화면 변경 및 중요한 오류에 대해 알려주기 위해 알림 권한이 필요합니다.
zh_tw: LiveWalls는 배경화면 변경 및 중요한 오류에 대해 알려주기 위해 알림 권한이 필요합니다.
